# ```Linux команды```


# 1. pwd - (print working directory) -> возвращает абсолютный путь до нашей директории 
# 2. ls - (list) -> выводит содержимое директории (текущей или указанной)
# 3. cd - (change directory) -> перемещает в домашнюю директорию 
#     cd ../ ( cd - ) -(одно и тоже)  -> возвращает на директорию выше 
#     cd / -> перемещает в корневую директорию (/)
#     cd <dir_name> -> перемещает в указанную директорию ( можно использовать абсолютный путь)
# 4. mkdir <dir_name> -> создает указанную директорию 
# 5. clear -> очищвет терминал (ctrl + L -> смещает)
# 6. touch <file_name> -> осздает указанный файл
# 7. rmdir <dir_name> -> удаляет указанную пустую директорию 
# 8. rm  <file_name> -> удаляет файл 
# 9. rm -rf <dir_name> (remove recursiv force ) -> удаляет указанную директорию со всем содержимым 
# 10. nano <file_name> -> открывает/создает файл в текстовом реадакторе
# 11. cat <file_name> -> выводит содержимое файла в терминал 
# 12. mv <file_name1> <file_name2> -> перемещает/переименовывает файл
# 13. cp <file_name1> <dir_name> -> копирует file_name1 в директорию dir_name
# 14. find -> ищет указанный файл или директорию 
# 	(универсальный вариант find /home -name <name>)
# 15. history -> выводит историю команд
# 16. sudo (brew -для мака) -> предоставляет права админа 
# 17. tree -> выводит дерево содержимое текущей директории 
# 18. echo  (text > file_name) -> записывает text в указанный файл 
# 19. cat (file_name > file_name2) -> копирует содержиемое file_name в file_name2
# 20. du <dir_name> (disk usage) -> показывает количество занимаемой памяти 
